{
  "main": {
    "name":"Ishan Singh",
    "currently":"Third year Computer Science student at UofT",
    "previously":"Integration Engineer @ Ericsson",
    "image":"profilepic.png",
    "bio":"II am a hard-working student with an aptitude for developing innovative solutions to complex problems. I see myself as an optimist and self-motivated person who can work in teams contributing to the ever-changing needs of business. I have an excellent academic record and diverse working experience with modern technologies. I seek to work in the field of software development to build on my knowledge while solving business challenges.",
    "contactmessage":"Thank you for viewing my portfolio, feel free to reach out to me using email or phone.",
    "email": "is.singh@mail.utoronto.ca",
    "phone": "647-770-5045",
    "github":"https://github.com/ishan-singh-3005",
    "linkedin": "https://www.linkedin.com/in/ishan-s/",
    "project":"https://github.com/ishan-singh-3005/ishans",
    "address":{
      "city":"Mississauga",
      "state":"Ontario"
    },
    "website": "https://ishan-singh-3005.github.io/ishans/",
    "resumedownload":"https://docs.google.com/document/d/1g5EycVtO0UvFSWe7OITLFyW7HbgiF-5Y9W1qpM-YUxA/edit?usp=sharing",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/ishan-s/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/ishan-singh-3005/",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Following are some of the technical skills I possess:",
    "education":[
      {
        "school":"University of Toronto",
        "degree":"Honours Bachelors of Science in Computer Science",
        "graduated":"April 2025",
        "description":"CGPA: 3.86/4.0"
      }
    ],
    "work":[
      {
        "company": "Ericsson",
        "years": ["May 2023 - Present"],
        "title": "Integration Engineer",
        "description": ["Developed a testing automation framework using Python, saving 50+ hours weekly for the team.", "Created a user-friendly portal in React and FastAPI to reduce test case generation time from minutes to seconds.", "Orchestrated the containerization of the framework into a Docker image that seamlessly integrated into the GitLab pipeline; 40% reduction in production bugs by running test suites asynchronously.", "Deployed the solution to a cloud-native environment using Kubernetes, ensuring scalability and efficiency."]
      },
      {
        "company":"Royal Bank of Canada",
        "title":"Software Developer",
        "years":"July 2020 - May 2022",
        "description": ["Managed the development of a Chrome extension URL shortener using React and Express, resulting in a 55% increase in user engagement during workshops.",
        "Integrated a MariaDB database for data storage and suggested the implementation of a Redis caching system, reducing response time by 35%.",
        "Led a team of 10 students in an agile development environment.",
        "Enhanced an internal retrospective application using ReactJS, resulting in a 30% increase in user engagement.",
        "Introduced new features such as real-time collaboration and enhanced data visualization, which were requested by users, resulting in a 15% increase in user satisfaction.",
        "Presented the project at various internal events with an audience of up to 150 attendees. Estimated the adoption of the application by 15,000 employees, representing 25% of the company's total workforce."]
      },
      {
        "company":"University of Toronto",
        "title":"Research Assistant",
        "years":"July 2019 - August 2019",
        "description": ["Developed a Python script to gather essential images to train the machine learning model, enhance data diversity, and boost accuracy by 15%.",
        "Optimized an analysis tool for ASKAP telescope data that enabled classification of celestial objects, resulting in a significant 30% enhancement in overall performance."]
      }
    ],
    "skills":[
      {
        "name":"Languages",
        "description":"Python, Java, C, JavaScript/ TypeScript, HTML, CSS"
      },
      {
        "name":"Frameworks and database",
        "description":"TensorFlow, Node.js, Express, React, React Native, FastAPI, Flask, MongoDB, MariaDB, SQL"
      },
      {
        "name":"Tools",
        "description":"Git, Bash, Docker, Redis, Twilio, Robot Framework, Arduino"
      },
      {
        "name":"Leadership skills",
        "description":"Problem-solving, Agile, Teamwork, Time Management, Facilitation"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Core",
        "link": "https://github.com/jordanlipson/uofthack-project",
        "info": "Core was an overall third place winner at UofTHacks. Used TensorFlow to analyze key points of the user to determine if they are performing their exercises correctly. Users can use visual indications on the screen and live auditory feedback to reduce the risk of potential injury while exercising."
      },
      {
        "title":"Disease Classifier",
        "link": "https://github.com/ishan-singh-3005/DiseaseClassifier",
        "info": "A machine learning model that determines if the user is more or less likely to have a heart disease. The backend is built leverages fastapi and python whereas the frontend is built using React.js."
      },
      {
        "title":"elDEARly",
        "link": "https://github.com/utmgdsc/eIDEARly",
        "info": "This app aims to aid elderly people in using modern technology and bridge the digital literacy gap between elders and the current generation. The app includes features such as text-to-speech, text search, and a chatbot. This app was built using React Native and the learning materials are stored in a MongoDB database. The project was completed in a team of four."
      },
      {
        "title":"Tetris",
        "link": "https://github.com/ishan-singh-3005",
        "info": "This project was built as part of the CSC207 course. Tetris is a single player game built using Java. The user interface is built using the JavaFX framework."
      },
      {
        "title":"Boggle",
        "link": "https://github.com/ishan-singh-3005",
        "info": "This project was built as part of the CSC207 course. Boggle is a single player game built using Java. The user interface is built using the JavaFX framework. Features contributed by include saving a local highscore and a timer integration. The project was completed in a team of four."
      },
      {
        "title":"A-star pathfinding visualizer",
        "link": "https://github.com/ishan-singh-3005/a-star-pathfinding",
        "info": "Used python to implement the a-star pathfinding algorithm and created a visualizer using pygame."
      }
      ,
      {
        "title":"Huffman file compression",
        "link": "https://github.com/ishan-singh-3005/huffman",
        "info": "This project implements the Huffman's compression algorithm using python."
      }
    ]
  }
}
